vegeta-cli/src/vegeta/aeromant/templates/compressor_mrf/com/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
  Aeromant template case — values in {{...}} are inserted by aeromant.prepare()
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform ({{AXIAL_GUESS}} 0 0);

boundaryField
{
    "inlet.*"
    {
        type            pressureInletOutletVelocity;
        value           uniform ({{AXIAL_GUESS}} 0 0);
    }
    "outlet.*"
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
    }
    "(body|shroud).*"
    {
        type            noSlip;
    }
    farfield
    {
        type            noSlip;
    }
}

// ************************************************************************* //
