vegeta-cli/src/vegeta/aeromant/templates/compressor_mrf/com/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
  Aeromant template case — values in {{...}} are inserted by aeromant.prepare()
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform {{K_INLET}};

boundaryField
{
    "inlet.*"
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       {{TURBULENCE_INTENSITY}};
        value           uniform {{K_INLET}};
    }
    "outlet.*"
    {
        type            inletOutlet;
        inletValue      uniform {{K_INLET}};
        value           uniform {{K_INLET}};
    }
    "(body|shroud).*"
    {
        type            kqRWallFunction;
        value           uniform {{K_INLET}};
    }
    farfield
    {
        type            kqRWallFunction;
        value           uniform {{K_INLET}};
    }
}

// ************************************************************************* //
