vegeta-cli/src/vegeta/aeromant/templates/compressor_mrf/com/constant/MRFProperties
/*--------------------------------*- C++ -*----------------------------------*\
  Aeromant template case — values in {{...}} are inserted by aeromant.prepare()
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      MRFProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

impeller
{
    cellZone            rotorZone;
    active              yes;
    nonRotatingPatches  ("shroud.*" "inlet.*" "outlet.*" farfield);
    origin              ({{ROTOR_CENTER}});
    axis                (1 0 0);
    omega               {{OMEGA}};      // rad/s about +x (right-hand rule); sign = rotation parameter
}

// ************************************************************************* //
