vegeta-cli/src/vegeta/aeromant/templates/compressor_mrf/com/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  Aeromant template case — values in {{...}} are inserted by aeromant.prepare()
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     rhoSimpleFoam;

startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         {{ITERATIONS}};
deltaT          1;
writeControl    timeStep;
writeInterval   {{ITERATIONS}};
purgeWrite      0;
writeFormat     ascii;
writePrecision  8;
writeCompression off;
timeFormat      general;
timePrecision   6;
runTimeModifiable false;

functions
{
    // torque on the impeller (pressure relative to the inlet total pressure: the impeller surface is closed, so this
    // only removes round-off)
    forces
    {
        type            forces;
        libs            ("libforces.so");
        writeControl    timeStep;
        writeInterval   1;
        log             yes;
        patches         ("body.*");
        rho             rho;
        pRef            {{INLET_TOTAL_PRESSURE}};
        CofR            ({{ROTOR_CENTER}});
    }
    magU
    {
        type            mag;
        libs            ("libfieldFunctionObjects.so");
        field           U;
        executeControl  timeStep;
        writeControl    writeTime;
    }
    inletFlow
    {
        type            surfaceFieldValue;
        libs            ("libfieldFunctionObjects.so");
        writeControl    timeStep;
        writeInterval   1;
        log             no;
        writeFields     false;
        regionType      patch;
        names           ("inlet.*");
        operation       sum;
        fields          (phi);
    }
    outletFlow
    {
        $inletFlow;
        names           ("outlet.*");
    }
    inletState
    {
        $inletFlow;
        operation       weightedAverage;
        weightField     phi;
        fields          (p T mag(U));
    }
    outletState
    {
        $inletState;
        names           ("outlet.*");
    }
}

// ************************************************************************* //
