vegeta-cli/src/vegeta/aeromant/templates/compressor_mrf/com/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  Aeromant template case — values in {{...}} are inserted by aeromant.prepare()
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

castellatedMesh true;
snap            true;
addLayers       false;

geometry
{
    body.stl
    {
        type triSurfaceMesh;
        name body;
    }
    shroud.stl
    {
        type triSurfaceMesh;
        name shroud;
    }
    inlet.stl
    {
        type triSurfaceMesh;
        name inlet;
    }
    outlet.stl
    {
        type triSurfaceMesh;
        name outlet;
    }
    rotorZone
    {
        type searchableCylinder;
        point1 ({{ZONE_P1}});
        point2 ({{ZONE_P2}});
        radius {{ZONE_RADIUS}};
    }
}

castellatedMeshControls
{
    maxLocalCells           6000000;
    maxGlobalCells          24000000;
    minRefinementCells      0;
    maxLoadUnbalance        0.10;
    nCellsBetweenLevels     3;

    features
    (
        {
            file "body.eMesh";
            level {{SURFACE_LEVEL}};
        }
        {
            file "shroud.eMesh";
            level {{SURFACE_LEVEL}};
        }
        {
            file "inlet.eMesh";
            level {{PORT_LEVEL}};
        }
        {
            file "outlet.eMesh";
            level {{PORT_LEVEL}};
        }
    );

    refinementSurfaces
    {
        body
        {
            level ({{SURFACE_LEVEL}} {{SURFACE_LEVEL}});
            patchInfo
            {
                type wall;
            }
        }
        shroud
        {
            level ({{SHROUD_LEVEL}} {{SHROUD_LEVEL}});
            patchInfo
            {
                type wall;
            }
        }
        inlet
        {
            level ({{PORT_LEVEL}} {{PORT_LEVEL}});
            patchInfo
            {
                type patch;
            }
        }
        outlet
        {
            level ({{PORT_LEVEL}} {{PORT_LEVEL}});
            patchInfo
            {
                type patch;
            }
        }
        rotorZone
        {
            level (0 0);
            faceZone rotorZone;
            cellZone rotorZone;
            cellZoneInside inside;
        }
    }

    resolveFeatureAngle 30;

    refinementRegions
    {
        rotorZone
        {
            mode inside;
            levels ((1E15 {{ROTOR_LEVEL}}));
        }
    }

    // a point in the flow passage (not inside the impeller's metal, not outside the casing)
    locationInMesh ({{LOCATION_IN_MESH}});
    allowFreeStandingZoneFaces true;
}

snapControls
{
    nSmoothPatch            3;
    tolerance               2.0;
    nSolveIter              50;
    nRelaxIter              5;
    nFeatureSnapIter        10;
    implicitFeatureSnap     false;
    explicitFeatureSnap     true;
    multiRegionFeatureSnap  true;
}

addLayersControls
{
    relativeSizes           true;
    layers
    {
    }
    expansionRatio          1.2;
    finalLayerThickness     0.5;
    minThickness            0.1;
    nGrow                   0;
    featureAngle            60;
    nRelaxIter              5;
    nSmoothSurfaceNormals   1;
    nSmoothNormals          3;
    nSmoothThickness        10;
    maxFaceThicknessRatio   0.5;
    maxThicknessToMedialRatio 0.3;
    minMedialAxisAngle      90;
    nBufferCellsNoExtrude   0;
    nLayerIter              50;
}

meshQualityControls
{
    maxNonOrtho             65;
    maxBoundarySkewness     20;
    maxInternalSkewness     4;
    maxConcave              80;
    minVol                  1e-13;
    minTetQuality           1e-15;
    minArea                 -1;
    minTwist                0.02;
    minDeterminant          0.001;
    minFaceWeight           0.05;
    minVolRatio             0.01;
    minTriangleTwist        -1;
    nSmoothScale            4;
    errorReduction          0.75;
    relaxed
    {
        maxNonOrtho         75;
    }
}

mergeTolerance 1e-6;

// ************************************************************************* //
